#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  (async-shell-command "./init.sh")
#+end_src

#+RESULTS:
: #<window 53 on *Async Shell Command*<2>>

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./init.sh
  rm -rf -- build
  cp -apf -- source build
  cd build
  sh ./autogen.sh
  ./configure --help > ../configopts
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./configscript.sh
  . '/usr/lib/sdk/llvm18/enable.sh'
  export CC='clang'
  export CXX='clang++'
  rm -rf -- build
  cp -apf -- source build
  cd build
  sh ./autogen.sh
  ./configure "--prefix=$(cd ../ && realpath .)/install" '--enable-sixel'
  exit '0'
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./make.sh
  . '/usr/lib/sdk/llvm18/enable.sh'
  export CC='clang'
  export CXX='clang++'
  cd build
  make -j4
  exit '0'
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./install.sh
  . '/usr/lib/sdk/llvm18/enable.sh'
  export CC='clang'
  export CXX='clang++'
  cd build
  make -j4 install
  exit '0'
#+end_src
